#include <stdio.h>
#include <stdlib.h>
#include <limits.h>
#include <stdbool.h>

/* Αριθμός κορυφών */
#define V 5

/* Συνάρτηση που βρίσκει την κορυφή με το μικρότερο κόστος από το
   σύνολο των κορυφών που δεν έχουν εισαχθεί στο ελάχιστο ζευγνύων
   δένδρο */
int minCost(int cost[], bool known[]) {
	/* Αρχικοποίηση μεταβλητής */
	int min = INT_MAX, min_index;

	/* Εύρεση της κορυφής με το μικρότερο κόστος από αυτές που
	   δεν έχουμε επισκεφθεί */
	for (int i = 0; i < V; i++) {
		if (known[i] == false && cost[i] < min) {
			min = cost[i];
			min_index = i;
		}
	}

	/* Επιστροφή του αριθμού της κορυφής */
	return min_index;
}


/* Υλοποίηση αλγόριθμου Prim */
void primMST(int graph[V][V]) {
	/* Πίνακας με τον αριθμό του γονικού κόμβου */
	int path[V];
	/* Πίνακας με το κόστος κάθε ακμής */
	int cost[V];
	/* Πίνακες με τις κορυφές που έχουμε επισκεφθεί */
	bool known[V];

	/* Αρχικοποίηση του πίνακα known σε false,
	   αρχικοποίηση του πίνακα cost σε κάποιο μεγάλο αριθμό
	   και αρχικοποίηση του πίνακα path σε -1 */
	for (int i = 0; i < V; i++) {
		cost[i] = INT_MAX;
		known[i] = false;
		path[i] = -1;
	}

	/* Αρχικοποίηση του κόστους του πρώτου κόμβου σε 0 */
	cost[0] = 0;

	/* επανάληψη μέχρι να επισκεφθούμε όλες τις κορυφές */
	for (int i = 0; i < V - 1; i++) {
		/* Εύρεση της κορυφής με το μικρότερο κόστος από αυτές
		   που δεν έχουμε επισκεφθεί */
		int u = minCost(cost, known);

		/* Σήμανση ότι επισκεφθήκαμε την κορυφή */
		known[u] = true;

		/* Ανανέωση του κόστους και του γονικού κόμβου των
		   γειτονικών κόμβων που δεν έχουν ήδη συμπεριληφθεί
		   στο ελάχιστο ζευγνύων δένδρο */
		for (int j = 0; j < V; j++) {
			if (graph[u][j] && known[j] == false && graph[u][j] < cost[j]) {
				path[j] = u;
				cost[j] = graph[u][j];
			}
		}
	}

	/* Εκτύπωση του ελάχιστου ζευγνύωντος δένδρου */
	printf("Edge \tWeight\n");
	for (int i = 1; i < V; i++)
		printf("%d - %d \t%d \n", path[i], i, graph[i][path[i]]);
}

int main() {
	/* Δημιουργία ενός απλού γράφου με 5 κορυφές */
	int graph[V][V] = { { 0, 2, 0, 6, 0 },
		{ 2, 0, 3, 8, 5 },
		{ 0, 3, 0, 0, 7 },
		{ 6, 8, 0, 0, 9 },
		{ 0, 5, 7, 9, 0 } };

	/* Κλήση αλγόριθμου Prim */
	primMST(graph);

	system("PAUSE");
	return 0;
}
